{
    "id": "A",
    "title": "Treino A — Pernas + Abdômen",
    "subtitle": "Foco: Quadríceps, glúteos",
    "exercises": [
        {
            "name": "Agachamento Goblet",
            "meta": "4×12",
            "restType": "main",
            "setBadge": "4×12",
            "restSeconds": 90,
            "description": "Posição: segure um halter vertical à frente do peito (pegada neutra). Pés afastados na linha dos ombros, ponta levemente para fora. Desça mantendo tronco ereto e joelho alinhado com o pé. Profundidade até coxas quase paralelas. Suba focando na extensão do quadril e joelho."
        },
        {
            "name": "Lunge com halteres",
            "meta": "3×12 por perna",
            "restType": "main",
            "setBadge": "3×12/por perna",
            "restSeconds": 90,
            "description": "Segure halteres ao lado do corpo. Dê um passo à frente, desça até 90º no joelho da frente. Não deixar joelho avançar além da ponta do pé. Empurre pelo calcanhar da frente para voltar."
        },
        {
            "name": "Terra Romeno com halteres",
            "meta": "4×10",
            "restType": "main",
            "setBadge": "4×10",
            "restSeconds": 90,
            "description": "Segure halteres com pegada neutra. Flexione levemente os joelhos, mantenha coluna neutra, desça os halteres perto das canelas com hinge no quadril. Sinta posterior de coxa e glúteo. Suba sem estender lombar."
        },
        {
            "name": "Elevação pélvica (Hip Thrust)",
            "meta": "4×15",
            "restType": "main",
            "setBadge": "4×15",
            "restSeconds": 90,
            "description": "Encoste a parte superior das costas em um banco, halter apoiado no quadril. Empurre os quadris para cima até alinhamento entre ombros-quadril-joelhos. Contraia glúteos no topo. Retorne controlado."
        },
        {
            "name": "Panturrilhas em pé",
            "meta": "3×20",
            "restType": "accessory",
            "setBadge": "3×20",
            "restSeconds": 60,
            "description": "Em pé, halteres nas mãos, suba na ponta dos pés mantendo leve extensão e controle na descida. Pode executar em degrau para maior amplitude."
        },
        {
            "name": "Prancha",
            "meta": "3×60 s",
            "restType": "core",
            "setBadge": "3×60s",
            "restSeconds": 45,
            "description": "Corpo alinhado (ombros, quadril, tornozelos), antebraços no chão. Evitar queda do quadril ou elevação excessiva. Respiração regular."
        },
        {
            "name": "Elevação de pernas",
            "meta": "3×15",
            "restType": "core",
            "setBadge": "3×15",
            "restSeconds": 45,
            "description": "Deitado, mãos sob o quadril, leve elevação das pernas controlada até ~90° (ou menos se lombar for sensível). Evitar balanço."
        }
    ]
}